<template>
  <div>
  <!-- 컴포넌트에서 다른컴포넌트 사용하기
  1.컴포넌트 안에서 다른컴포넌트 사용하기
  2.컴포넌트를 사용한다는것에 대한 의미알기 
  컴포넌트 재활용 컴포넌트 안에서 활용하는 것
  -->
   <pegeTitle title="부모컴포넌트에서 전송할 페이지 입니다." />
   <!-- 하나의 컴포넌트에 불가하지만 
        실무에서 엄청 중요한 컴포넌트 이다. 
        대형프로젝트를 하게되면 컴포넌트는수백개
        수십명의 개발자가 투입되는데 각자의 설정과
        꾸밈이 달라 사용자가 접속했을때 보는
        페이지마다 색상과 폰트 크기가 다르다면 
        안돼기에 이렇게 페이지 타이틀이라는 
        ui를 만들어 놓고 각각에 개발자가 
        동일한 디자인으로 쓸수 있다면 굉장히 유용할거다
        예를들어 아까 만든 페이지 타이틀 컴포넌트를
        내가 만드는 화면에서는 내가만든 이그젬플10 부모컴포넌트에서
        자식컴포넌트로 데이터를 전달하는 방법을 알아보자  -->
        <!-- 푸롭스에서 타이틀에 정의한 키와 값을 부모인
        페이지에서 임포트로 불러와 템플릿에 추가하니 
        페이지타이틀 H1테그의 데이터바인딩 해놓은 
         게 보이는 상황-->
        <!--부모컴포넌트에서 어떻해 하면 던저줄수있냐?
          title=""-->
  </div>
</template>

<script>
import PegeTitle from '../components/pageTitle.vue';
export default {
  components: {
    PegeTitle,
  },
 data () {
     return {
       isActive: true,
       isRed: true,
       

     
     }
 },
}

</script>
<style scoped>  
</style>