<template>
  <div>
  <!-- 부모컴포넌트에서 자식컴포넌트로 데이터전달
  1.자식 컴포넌트로 데이터전달
  2.문자데이터 전달 
  3.숫자데이터 전달
  4.boolean 데이터전달
  5.배열 데이터 전달 
  6.오브젝트 데이터 전달 
  -->
   <pegeTitle v-bind:title="title1" />
   <!-- 지금보고있는건 고정적인 데이터를 전달할때 이고 
        동적인데이터를 전달하고 싶을떄는 
        아래 데이터필드에 title1이라는 변수를 만들고
        거기에 값을 주고 그걸 프롭스속성에 v-바인드로
        바인딩하여 데이터필드에 선언된 title1의 값이
        변경될때마다 변화가 있을시 값을 감시하여 
        값을 재 호출해준다 
         -->
        <!--부모컴포넌트에서 어떻해 하면 던저줄수있냐?
          title="" 이걸보면 페이지타이틀의 props내에 타이틀
          이란곳으로 위에 문자열을 그대로 전송한 것이고 
          저번처럼 :title="" 이거라면 ex10의 선언된 데이타 변수나 컴피티드
           메소드의 함수를 찾는것이다. -->
           <!-- 페이지타이틀이란 컴포넌트를가지고 테그로 
           만들었고 title="" 란 속성에 값을 넣어줬음
           속성이라 부르는건 HTML에서도 속성을 넣듯이 
           <input type="text"/>와 같이 동일하다 
           이렇게 속성을 정의를 하면은 반듯이 이속성은 
           해당하는 컴포넌트의 props안에 잡혀있어야 한다
            그럼 그속성이 값을 받아서 사용할수 있게된다.-->
            <!-- 만약 모든페이지에서 페이지타이틀이라는 
            컴포넌트를 가지고 페이지제목을 작성했다면 
            계절에따라 색상을 바꾸고싶은데 각자 만들었다면
            그거 역시 가개발자가 화면에 전부 녹색으로 해야하는데
            그해당하는 컴포넌트 의 디자인만 바꾸면 전부 수정이되는
            우리가원하는 심플하게 전체 웹플리케이션에 
            동일하게 동일한 ul를 해줄수있다.
            이렇게하는건 플젝을 여러개하다보면 동일한 
            컴포넌트를 만들다보면 다음플젝에서도 지속적으로
            사용할수있다
            이런게 쌓이다보면 중요한 자산으로 남게된다.  -->
  </div>
</template>

<script>
import PegeTitle from '../components/pageTitle.vue';
export default {
  components: {
    PegeTitle,
  },
 data () {
     return {
       title1: '부모컴포넌트에서 전송할 페이지타이틀 입니다.(ex11)',
       
       

     
     }
 },
}

</script>
<style scoped>  
</style>