<template>
<div class="modal-container">
    <header>
        <slot name="header"></slot>
    </header>
    <main>
        <slot></slot>
    </main>
    <footer>
        <slot name="footer"></slot>
    </footer>
</div>  
<!--컴포넌트는 재활용 가능하며 컴퍼넌트는 여러개의 컴포넌트를 자식컴포넌트로 임포트해서 사용할 수 있다는 것을 배웠습니다 
어 그런데 프로젝트를 진행 하다 보면 어떤 화면에 경우는 굉장히 비슷한 기능을 가지고 있는데 아주 일부만 다르게 사용하는 
경우가 많이 있어요 그래서 이번 강의에서 배울 건데 술 마실 하는 건데요 이슬라스 하는 거는 컴포넌트 내에서 다른 컴포넌트를 사용할 때 
사용하는 컴퍼넌트 자식컴포넌트에서 컴포넌트의 특정 URL이 부분을 계정이에서 사용하는 거예요 우리 기존의 부모컴포넌트에서 자식컴포넌트에 
데이터를 전달하고 이런 걸 했잖아요 근데 오늘 배울 슬라이스는 사실 컴포넌트의 UI 마크업을 제정해서 사용할 수 있는 기능입니다
그래서 굉장히 많이 쓰게 되는 기능이구요 지금 보시는 그 화면 같은 경우에이 바보 같은 경우에는 우리가 흔히 모달창이라고 
하는 팝업 이거든요 실제 애플리케이션을 개발 하다 보면은 굉장히 많이이 모달창을 사용하게 되어 여러분들 화면에서 뭔가 링크나 
버튼을 클릭했을 때 모자라면 모달창 팝업창을 통해서 그 클릭한 링크 회장으로서 정보를 보여주는 뭐 이런 어떤 모달처럼 굉장히 많이 쓰게 되는데 
보시는 것처럼 모달창을 타이틀 여기 있고 여기 있고 그 박층 마트 명령에는 보통 뭐 해 준 클로 좀 버튼이 있거나 아니면 모델이 따로 저장하기 
위한 팝업 일하면 그런 거 세이브 넣었더니거나 이런 굉장히 정형화된 UI를 갖고 있어요 근데 열리면 팝업 팝업 내일 되면은 뭐이 바보 모달창 
제목이 당한다거나 아니면 아니면 뭐 버튼이 좀 다르다거나 뭐 그렇게 되잖아요 그래서 내가 이런 경우에는 모달창 같은 경우에도 우리 이번 강의에서 
4월 26일 하는 거를 이용을 해서 만들면 굉장히 정형화된 그 UI를 갖는 모달창을 좀 쉽게 생각하는 거 쓸 수가 있거든요 그래서 그런 오늘 이번 강의에서 
여러분께 좀 알려 드리려고 하고 있어요 제가 이번 강좌에서는 보신 것 좀 이따 코드를 일단 미리 좀 준비를 했어요 보시는 
코드는 제가 제 3의 주차장에 div 태그가 있고요 플러스는 모델 컨테이너라고 그냥 하나 만들어 놨어요 보시는 것처럼 그리고 도심에 해도가 있고 
그리고 포토가있고 메인 있어요 그리고 보시면 해도 밑에 플러스라고 되면 뭐 있어 그리고 메인 안에도 플러스라고 대부분 보이죠 그리고 포터 안 해도 부분이고요 
생소하죠 부분이 보이고 있어요 자 여기서이 코드안에서 클라스로 시작해서 삶아서 끝나는 부분 있죠 있죠이 부분은 지금 제가 만들어 놓은 슬랏 모델 레이아웃 좀비라는
 파일인데 컴포넌트를 사용하는 부모컴포넌트에서 슬라이스란 부분을 재정 일할 수 있을까 하는 거죠 데이트하는 거 전달하고 이런게 아니고 순수하게 오늘 입금 되는 거예요 
 부모컴포넌트에서이 두 번만 해주면 나머지 감싸 있는 부분이라 여기 안에 많이 우리가 먹는 클래스 디자인을 다 전복을 시켜 놨다 면은 그러면 그대로 반영이 되는 거예요 
 그러면 이슬람모자 레이어스이라는 거를 임포트해서 사용하는 모든 컨퍼런스에서는 각자 자기 컴포넌트에서 모달창을 띄울 때 필요한 부분이 하자 영역 바디 영역으로부터 
 명령만 해서 예를 호출 하면은 다 동일한 형태의 뭐 잘 화면을 3월 수 있게끔 되는 거야 진짜 굉장히 많이 하셔야 되거든요 등을 이렇게 제가 플라모델 내가 실행을 만들었고요 그리고 예를 임포트해서 쓸 유주 모델 레이아웃 좀 주라고 이것도 입체감이 만들어놨어요 미리 만들었고요 여름이즈 코드 보실 줄 알 거예요 코드 보시면 임포트해서 모달레이어 우리가 만든 슬라임 모든 것을 임포트 했고요 그리고 컴포넌트의 플라모델 레이아웃을 사용하겠다고 정리를 했는데 이름은 모델 다시 레이아웃으로 사용하겠다고 점에서 여기까지만 그리고 여기 보시면 모자를 임포트한 컴퍼넌트를 사용하겠다고 여기 이렇게 정리를 했어야 보시는 것처럼 그 여기 안에 보면은 템플릿으로 대부분 볼 거 샘플 템플릿 템플릿 팸플릿 템플릿은 몇 개 있죠 하나 두 개 세 개 이렇게 세 개 있죠 그 쪽 보면은 템플릿 신데 vs 마술하는 맥주를 vs vs vs vs vs 해 달라고 해 달라고 했죠 그리고 우리가 만든 플라모델 내려가보면 슬러시라고 되어 있고 네임은 해 달라고 해 보시죠 자 그럼 이렇게 하면은 vs 올라타고 코로나고 해 주라고 하면은이 템플릿으로 감싸져있는 것 안에 들어가 있는 엑스맨 태그가 코드가 이슬람 모델 레이아웃의 이름은 하더라고 대부분의 교체가 된 거야이 부분 교체 하실 거예요 그리고 자 밑에 보시면 이번엔 캠플리 신데 V 슬라이서 뒤프트랑 디폴트 그리고 두 개가 있어요 다시 우리 신랑 모델 냄새가 보면 가운데 메일에 보면 술 마시려고 눈요기도 울려 이름을 안 정해 놓은 거예요 이름을 안 정해 놓은 경우에는 애를 쓰는 곳에서 vs 했다고 디폴트라고 하면은 이름 안 정해 한 곳에 들어가게 되는 거야 이따가 한번 바꿔 볼게요 그리고 밑에 보시면 vs 나프타에서 버튼 있어요 그 차 위에 보시면 신랑 내일부터 하고 있어요 대부분이 부모컴포넌트에서 템플릿 안에 정리 된 걸로 교체 가세요 그리고 이거는 제가 우리 신랑 모델 하우스 있는 거랑 똑같은 순서로 헤더 디폴트 타기 순서로 여기도 맞췄는데 그거 순서대로 안쪽 필요가 없어요 그냥 이름 따라 가는 거거든요 얘가 위에서 상관없는 거예요 EBS 콜로니에서 정의의 이름으로 찾아 가는 거기 때문에 전혀 미치는 상관이 없어요 일단이 상태에서 잘 나오는지 저장하고 화면을 확인해 볼게요 그러니까 제가 요즘 수료증을 모자를 쓰는 거를 라우트 보시면 패션을 클라스란 이름으로 축하를 해 놨어요 그래서 이게 보시면요 크로스 8080 술 마시려고 하는데 나오는 거야 이렇게 잘 나오고 있죠 우리가 지금 정리하는게 참 미친 아까 얘가 우리 메인 위에 있더라도 정상적으로 잘 찾아간다고 확인할게요 밑에 바꿨죠 하지만 그 화면이 프레스 보면은 그 때문에 작게 버튼은 사이에 있는게 아니고 밑에 있어요 그 이름 따라 가는 거거든요 자 그리고 만약에 테슬라 모델 레이아웃에 우리가 신라시대 네임을 이거를 메인으로 저기서 이렇게 그러면 당연히 설날 요즘 모텔에 가서 잘 찍는 거를 내일 바꿔준다는 거죠 이렇게 그러면 또 정당 좀 이렇게 잘 나오게 돼요네 실제 우리가 백플레이트를 많이 때문에 슬슬 굉장히 많이 이용하게 되고 잘 쓰는게 여러분 그 프로젝트 진행 할 때 굉장히 개발 생산성이나 어떤 사용자에게 전달하는 어떤 UX 되게 좋은 기회를 또 만날 수가 있어요 왜냐면은 우리 허니 실수한 것 중에 하나가 제가 굉장히 자주 이런 말을 많이 하는데 대형 프로젝트를 하게 되면은 개발자가 많이 들어와요 그러면 별거 아닌 것 좀 보내지 마 이런 모달창 사업자가 띄우는 것도 제각각 UI를 만들어 사용하는 경우가 있거든요 그럼 사지 사용자 입장에서는 하나의 애플리케이션에서 내가 들어간 화면에 따라서 보여지는 모달팝업창 다다르면 굉장히 약간 UX 적으로 내가 안 좋거든요 근데 이렇게 이런 식으로 만약에 정리하고 여기다가 이름을 스타일 28일 정리할 수 있잖아요 스타일 정리해서 여기에서 뭐 해 주면은 모자 창에다 스타일 다 정리해 놓으면은 모달창을 사용 해서 뛰더라도 스타일 다 동일한 타이틀 어떤 디자인 그리고 어떤 그 전체적으로 다 동일하게 가져갈 수가 있잖아요 그러면 개발자는 1월 전체적인 디자인은 이런 느낌은 고릴라 필요 없이 그냥 이렇게 태블릿을 이용해서 그 안에 들어가는 컨텐츠만 정리를 하면 사용할 수 있게 되는 거잖아요 그래서 되게 유명한 기능이고 여러분이 반드시 알아야 되는 기능 중에 하나 해라 그래서 이번 강좌에서는 우리가 사랑을 되었고요 슬슬 부모컴포넌트에서 슬라이스로 정의된 자식컴포넌트 인터넷에서 사용을 하는데 경희대 마크업 html 코드 해당하는 마크업을 재정에서 사용할 수 있는게 술 마신 거예요 그래서 이번 강좌에서는 설날에 대해서 알아보는 시간을 가졌습니다
-->
</template>

